<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"551b0ab63648aec0b4e2973f7cdff7fc1454c5f3c53513da744571a46565a4b9","plan_job_ref":"Job Create terraform plan #104 at https://github.com/presentium/infrastructure/actions/runs/10655729835","plan_out_hash":"e68f40bb8ffbbf29c0139caea93bd4670e01ecb797effacef991748f837c6c2f","plan_hash":"614b2d217fdea8f2cb343847bd604639a1eb4e1ac3e3bd3fdf0928872c8bbea8","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam.aws_iam_user_login_profile.login["Lea"] is tainted, so must be replaced
-/+ resource "aws_iam_user_login_profile" "login" {
+       encrypted_password      = (known after apply)
!~      id                      = "***" -> (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_reset_required = (known after apply)
!~      pgp_key                 = "********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************"
#        (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  iam_users             = {
!~      Lea        = "wcFMA9jYz27SnaN8AQ//bU+rwTu+l2L+3NnqGmF2dPHNjJA793P/PNFlDX7GZggzWJqkhYW4cfqrSm7o1J1+T2XgkfWGVV+9BPAMmK+4rg5lVG6I03CXS+HLAJG2FkdYCdQZoJ7ZiN00F6TblWbBeX1pwVJ2UHMF9FdwCwsTvLDmHfpZnpl5nth6vF9rb1j9AE0X3RUjI9hVn6GAxIhINKUTcDQtUV4eE+rc3HnO6jk5UO1S+xQbkd3LNurePG+KaWeQXmRaaDpTajXrNXfp4qGbnsstBwZLzCLrtp6xt7IoMmr4HIhSlerXDQ3ktTH1SYLqecbNbvveqj0HHcjNoF7KtBSWs9iTZUsQ0gWCrka31Pm2GXLS96LwlJwGCVfpnDyAMy7uBPjQriywuXT8+zmu1EbzcxbhO8B2iohyRXLRjW0oZLtIX/8HNWNXGoK1IkhmAnnOQ9oN6YcgifkciD+n/eWXIEvOlPiiJl6ZmQ4tYJd4EtoSTZdlCk8olCIugW06bivKLoKWC0qabnLc4bB+imyxbGixqS9P0LrO/chQW7Q7dg4U5obN5vQ83xzP4hU3jk1J+Za9BW0uRTmUdEjZgIFh8dg7HjPNyh80+tVQEHgqHJwqXKCfoD+hQ9YKlgJcjng9PhxPlQ5xwHe03U1uRo7mCFceR3QEB5fYp0ICaUBpwu5tEFguw0lbI6HSRQGkDwHxDlY8fSoNl4oJQJK0bwvEZU+XF5gKdjpOi57BtPlBslGULyj42IXyTJ5Plp4/QcZtSeent6YE+BfcBSZxf793pQ==" -> (known after apply)
#        (4 unchanged attributes hidden)
    }
```
</details>

:x: Error applying plan in [Apply terraform plan #40](https://github.com/presentium/infrastructure/actions/runs/10655739888)